# Lecture : DataFrames

Estimated time needed: **90** minutes

## Objectives

The aim of this notbeook is to give you an understanding of how to deal with datasets in Python using the Pandas Library. You will gain inisghts like 


* Creating Table
* Adding or Removing Rows & Columns 
* Statistics of Dataset
* Multi Indexing

___

## What are DataFrames ? 

DataFrames are the workhorse of pandas and are directly inspired by the R programming language. We can think of a DataFrame as a bunch of Series objects put together to share the same index. Let's use pandas to explore this topic!

In [1]:
import pandas as pd
import numpy as np

In [7]:
'A B C D E'.split()

['A', 'B', 'C', 'D', 'E']

In [2]:
df = pd.DataFrame(np.random.randn(5,4),index='A B C D E'.split(),columns='W X Y Z'.split())
df

          W         X         Y         Z
A  0.547817 -1.805434 -2.271596 -1.951541
B  1.118205  1.056192 -1.899909 -1.263193
C -3.547515 -0.952714 -0.122195 -1.425733
D -0.927857 -1.289591  0.295001 -0.039881
E  2.081455  0.624757  0.809324 -2.248954

In [8]:
df.loc['C','Y']

-2.2111362083771144

In [9]:
df

          W         X         Y         Z
A -0.311262 -0.105548 -0.245949  0.613357
B -0.168928 -1.279977 -0.587057  1.734285
C -2.028401 -2.449713 -0.827067 -1.867082
D -0.643578  0.116364 -0.173733 -0.961986
E  0.144145  0.304137  1.668903 -1.212063

In [8]:
np.random.randn()

-1.2359602331957618

# Basic Information
shape, cols, index,

In [3]:
df

          W         X         Y         Z
A  0.547817 -1.805434 -2.271596 -1.951541
B  1.118205  1.056192 -1.899909 -1.263193
C -3.547515 -0.952714 -0.122195 -1.425733
D -0.927857 -1.289591  0.295001 -0.039881
E  2.081455  0.624757  0.809324 -2.248954

In [4]:
df.shape

(5, 4)

In [5]:
df.columns

Index(['W', 'X', 'Y', 'Z'], dtype='object')

In [6]:
df.index #values dtype - numpy

array(['A', 'B', 'C', 'D', 'E'], dtype=object)

In [10]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, A to E
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   W       5 non-null      float64
 1   X       5 non-null      float64
 2   Y       5 non-null      float64
 3   Z       5 non-null      float64
dtypes: float64(4)
memory usage: 200.0+ bytes

In [7]:
df.isnull().sum() # non - null values

W    0
X    0
Y    0
Z    0
dtype: int64

In [11]:
df.memory_usage(index=True)

Index    40
W        40
X        40
Y        40
Z        40
dtype: int64

## Retrieving Information

In [16]:
# First 5 Rows - Head

df.head(1)

          W         X         Y         Z
A  0.547817 -1.805434 -2.271596 -1.951541

In [15]:
# Last 5 Rows - Tail

df.tail(1)

          W         X         Y         Z
E  2.081455  0.624757  0.809324 -2.248954

In [23]:
# random row from data -- sample , by default 1

df.sample(2)

          W         X         Y         Z
E  2.081455  0.624757  0.809324 -2.248954
B  1.118205  1.056192 -1.899909 -1.263193

In [24]:
df

          W         X         Y         Z
A  0.547817 -1.805434 -2.271596 -1.951541
B  1.118205  1.056192 -1.899909 -1.263193
C -3.547515 -0.952714 -0.122195 -1.425733
D -0.927857 -1.289591  0.295001 -0.039881
E  2.081455  0.624757  0.809324 -2.248954

### Access Columns

In [26]:
df['Z']

A   -1.951541
B   -1.263193
C   -1.425733
D   -0.039881
E   -2.248954
Name: Z, dtype: float64

### Access Rows

In [30]:
df.loc[['E']]

          W         X         Y         Z
E  2.081455  0.624757  0.809324 -2.248954

In [31]:
df.iloc[-1]

W    2.081455
X    0.624757
Y    0.809324
Z   -2.248954
Name: E, dtype: float64

In [33]:
df

          W         X         Y         Z
A  0.547817 -1.805434 -2.271596 -1.951541
B  1.118205  1.056192 -1.899909 -1.263193
C -3.547515 -0.952714 -0.122195 -1.425733
D -0.927857 -1.289591  0.295001 -0.039881
E  2.081455  0.624757  0.809324 -2.248954

In [35]:
df.min() # each col minimum number , axia = 1 for row

W   -3.547515
X   -1.805434
Y   -2.271596
Z   -2.248954
dtype: float64

In [11]:
df.sample(n=3)

          W         X         Y         Z
B  2.780637  0.872266 -0.925909  0.862049
C -0.670682 -0.430535 -2.211136  0.008447
D -0.319648 -0.897195 -1.189647  1.217204

In [15]:
df.max(axis=1) # rows wise max

A    0.613357
B    1.734285
C   -0.827067
D    0.116364
E    1.668903
dtype: float64

In [38]:
df.idxmin(axis=1) # index minimum value

A    Y
B    Y
C    W
D    X
E    Z
dtype: object

In [39]:
df.idxmax()

W    E
X    B
Y    E
Z    D
dtype: object

In [13]:
newdf = pd.DataFrame(np.random.choice([1, 2, 3], (5, 4), p=[0.1, 0.5, 0.4]), columns=['A','B','C','D'])

In [14]:
newdf

   A  B  C  D
0  2  2  3  2
1  2  3  2  2
2  2  1  2  3
3  2  3  2  3
4  2  2  2  3

In [15]:
newdf.cumsum(axis=1)

   A  B  C   D
0  2  4  7   9
1  2  5  7   9
2  2  3  5   8
3  2  5  7  10
4  2  4  6   9

In [18]:
newdf.loc[0,'A'] = np.nan

In [19]:
newdf

     A  B  C  D
0  NaN  2  3  2
1  2.0  3  2  2
2  2.0  1  2  3
3  2.0  3  2  3
4  2.0  2  2  3

### to find values 

* loc - label indexing (rows)
* iloc - num indexing (rows)



dataset.column_name

In [22]:
import seaborn as sns
df = sns.load_dataset('iris')
df.loc[[89]]

    sepal_length  sepal_width  petal_length  petal_width     species
89           5.5          2.5           4.0          1.3  versicolor

In [26]:
df[['sepal_length','petal_length']]

     sepal_length  petal_length
0             5.1           1.4
1             4.9           1.4
2             4.7           1.3
3             4.6           1.5
4             5.0           1.4
..            ...           ...
145           6.7           5.2
146           6.3           5.0
147           6.5           5.2
148           6.2           5.4
149           5.9           5.1

[150 rows x 2 columns]

In [10]:
df.describe()

       sepal_length  sepal_width  petal_length  petal_width
count    150.000000   150.000000    150.000000   150.000000
mean       5.843333     3.057333      3.758000     1.199333
std        0.828066     0.435866      1.765298     0.762238
min        4.300000     2.000000      1.000000     0.100000
25%        5.100000     2.800000      1.600000     0.300000
50%        5.800000     3.000000      4.350000     1.300000
75%        6.400000     3.300000      5.100000     1.800000
max        7.900000     4.400000      6.900000     2.500000

In [45]:
df.mean()

W   -0.119117
X    0.336940
Y    0.619320
Z    0.576075
dtype: float64

In [46]:
df.median()

W   -0.912142
X    0.042058
Y    0.445691
Z    0.608569
dtype: float64

## Selection and Indexing

Let's learn the various methods to grab data from a DataFrame

In [29]:
df = df[:10] # first 10 rows
df

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa
5           5.4          3.9           1.7          0.4  setosa
6           4.6          3.4           1.4          0.3  setosa
7           5.0          3.4           1.5          0.2  setosa
8           4.4          2.9           1.4          0.2  setosa
9           4.9          3.1           1.5          0.1  setosa

In [30]:
df['sepal_length'] # series extraction

0    5.1
1    4.9
2    4.7
3    4.6
4    5.0
5    5.4
6    4.6
7    5.0
8    4.4
9    4.9
Name: sepal_length, dtype: float64

In [31]:
# Pass a list of column names
# dataset_name[['colx', 'coly', 'colz' ,......, 'coln']]
df[['sepal_length','petal_length']]

   sepal_length  petal_length
0           5.1           1.4
1           4.9           1.4
2           4.7           1.3
3           4.6           1.5
4           5.0           1.4
5           5.4           1.7
6           4.6           1.4
7           5.0           1.5
8           4.4           1.4
9           4.9           1.5

In [33]:
# SQL Syntax (NOT RECOMMENDED!)
df.sepal_length.head()

0    5.1
1    4.9
2    4.7
3    4.6
4    5.0
Name: sepal_length, dtype: float64

In [34]:
df.tail()

   sepal_length  sepal_width  petal_length  petal_width species
5           5.4          3.9           1.7          0.4  setosa
6           4.6          3.4           1.4          0.3  setosa
7           5.0          3.4           1.5          0.2  setosa
8           4.4          2.9           1.4          0.2  setosa
9           4.9          3.1           1.5          0.1  setosa

DataFrame Columns are just Series

In [25]:
type(df['W'])

pandas.core.series.Series

**Creating a new column:**

In [35]:
# dataset_name['new_col_name'] = operation
df['sp_length'] = df['sepal_length'] + df['petal_length']

/var/folders/0b/_lhktjtd7_nbl39rvt0kjvmr0000gn/T/ipykernel_46729/2929247190.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['sp_length'] = df['sepal_length'] + df['petal_length']

In [36]:
df

   sepal_length  sepal_width  petal_length  petal_width species  sp_length
0           5.1          3.5           1.4          0.2  setosa        6.5
1           4.9          3.0           1.4          0.2  setosa        6.3
2           4.7          3.2           1.3          0.2  setosa        6.0
3           4.6          3.1           1.5          0.2  setosa        6.1
4           5.0          3.6           1.4          0.2  setosa        6.4
5           5.4          3.9           1.7          0.4  setosa        7.1
6           4.6          3.4           1.4          0.3  setosa        6.0
7           5.0          3.4           1.5          0.2  setosa        6.5
8           4.4          2.9           1.4          0.2  setosa        5.8
9           4.9          3.1           1.5          0.1  setosa        6.4

** Removing Columns**

In [37]:
df.drop('sp_length',axis=1)

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa
5           5.4          3.9           1.7          0.4  setosa
6           4.6          3.4           1.4          0.3  setosa
7           5.0          3.4           1.5          0.2  setosa
8           4.4          2.9           1.4          0.2  setosa
9           4.9          3.1           1.5          0.1  setosa

In [40]:
# Not inplace unless specified!
df.sample()

   sepal_length  sepal_width  petal_length  petal_width species  sp_length
4           5.0          3.6           1.4          0.2  setosa        6.4

In [41]:
df.drop('sp_length',axis=1,inplace=True)

/var/folders/0b/_lhktjtd7_nbl39rvt0kjvmr0000gn/T/ipykernel_46729/3107272069.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df.drop('sp_length',axis=1,inplace=True)

In [42]:
df.head()

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

Can also drop rows this way:

In [43]:
df.drop(2,axis=0) # rows

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa
5           5.4          3.9           1.7          0.4  setosa
6           4.6          3.4           1.4          0.3  setosa
7           5.0          3.4           1.5          0.2  setosa
8           4.4          2.9           1.4          0.2  setosa
9           4.9          3.1           1.5          0.1  setosa

** Selecting Rows**

In [44]:
# dataset_name.loc['index_label_name']
# dataset_name.iloc['index_value']

df.loc[6], df.iloc[6]

(sepal_length       4.6
 sepal_width        3.4
 petal_length       1.4
 petal_width        0.3
 species         setosa
 Name: 6, dtype: object,
 sepal_length       4.6
 sepal_width        3.4
 petal_length       1.4
 petal_width        0.3
 species         setosa
 Name: 6, dtype: object)

In [18]:
df

          W         X         Y         Z
A  0.123546 -2.163495  0.619394  0.646979
B -0.111934  0.126971 -0.894941  2.343060
C  0.304202  0.593836  0.128427 -2.117163
D -0.276156 -1.020186 -0.680478 -0.829765
E -0.631544  1.160336  0.494870  0.205379

Or select based off of position instead of label

In [19]:
df.iloc[2]

W    0.304202
X    0.593836
Y    0.128427
Z   -2.117163
Name: C, dtype: float64

In [33]:
df.columns

Index(['W', 'X', 'Y', 'Z', 'new'], dtype='object')

** Selecting subset of rows and columns **

In [36]:
# dataset_name.loc[['R1', 'R2'...., 'Rn']]
df.loc[['A','B'],['new','X']]

        new         X
A -0.557211 -0.105548
B -0.755985 -1.279977

In [38]:
df.loc['A','Y'] # value at 1st Row and Yth Col

0.07793012639591339

In [41]:
df.loc[['A','C'],['X','Z']], #df.iloc[[0, 4], [col1, col2]]

          X         Z
A  1.262528 -0.635483
C  1.320746 -0.563091

### Conditional Selection

An important feature of pandas is conditional selection using bracket notation, very similar to numpy:

In [37]:
df

          W         X         Y         Z       new
A -0.311262 -0.105548 -0.245949  0.613357 -0.557211
B -0.168928 -1.279977 -0.587057  1.734285 -0.755985
C -2.028401 -2.449713 -0.827067 -1.867082 -2.855468
D -0.643578  0.116364 -0.173733 -0.961986 -0.817310
E  0.144145  0.304137  1.668903 -1.212063  1.813047

In [47]:
np.round(df[df>0.2].fillna('❌'),2)

   W         X         Y         Z       new
A  ❌         ❌         ❌  0.613357         ❌
B  ❌         ❌         ❌  1.734285         ❌
C  ❌         ❌         ❌         ❌         ❌
D  ❌         ❌         ❌         ❌         ❌
E  ❌  0.304137  1.668903         ❌  1.813047

In [27]:
df[df>0]

          W         X         Y         Z
A       NaN       NaN  0.861523       NaN
B  0.517393  2.191733  0.306848       NaN
C       NaN  1.444313       NaN       NaN
D       NaN       NaN  0.429802  0.470387
E       NaN       NaN       NaN  0.677930

In [17]:
df[df['Z']>0.4]

          W        X         Y         Z
D -1.486697  0.04097  0.371997  1.333418

In [19]:
df[df['Z']>0]['Y']

D    0.371997
Name: Y, dtype: float64

In [20]:
df[df['Z']>0][['Y','X']]

          Y        X
D  0.371997  0.04097

For two conditions you can use | and & with parenthesis:

In [23]:
df[(df['W']>0.8) | (df['Y'] > 1)]

          W         X         Y        Z
B  0.971687  1.380024 -0.509702 -0.67883

## More Index Details

Let's discuss some more features of indexing, including resetting the index or setting it something else. We'll also talk about index hierarchy!

In [48]:
df

          W         X         Y         Z       new
A -0.311262 -0.105548 -0.245949  0.613357 -0.557211
B -0.168928 -1.279977 -0.587057  1.734285 -0.755985
C -2.028401 -2.449713 -0.827067 -1.867082 -2.855468
D -0.643578  0.116364 -0.173733 -0.961986 -0.817310
E  0.144145  0.304137  1.668903 -1.212063  1.813047

In [47]:
# Reset to default 0,1...n index
df.reset_index()

   index  sepal_length  sepal_width  petal_length  petal_width species
0      0           5.1          3.5           1.4          0.2  setosa
1      1           4.9          3.0           1.4          0.2  setosa
2      2           4.7          3.2           1.3          0.2  setosa
3      3           4.6          3.1           1.5          0.2  setosa
4      4           5.0          3.6           1.4          0.2  setosa
5      5           5.4          3.9           1.7          0.4  setosa
6      6           4.6          3.4           1.4          0.3  setosa
7      7           5.0          3.4           1.5          0.2  setosa
8      8           4.4          2.9           1.4          0.2  setosa
9      9           4.9          3.1           1.5          0.1  setosa

In [52]:
newind = 'CA NY WY OR CO'.split()

In [53]:
df['States'] = newind

In [49]:
df

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa
5           5.4          3.9           1.7          0.4  setosa
6           4.6          3.4           1.4          0.3  setosa
7           5.0          3.4           1.5          0.2  setosa
8           4.4          2.9           1.4          0.2  setosa
9           4.9          3.1           1.5          0.1  setosa

In [45]:
# SET INDEX
df.set_index('species')

         sepal_length  sepal_width  petal_length  petal_width
species
setosa            5.1          3.5           1.4          0.2
setosa            4.9          3.0           1.4          0.2
setosa            4.7          3.2           1.3          0.2
setosa            4.6          3.1           1.5          0.2
setosa            5.0          3.6           1.4          0.2
setosa            5.4          3.9           1.7          0.4
setosa            4.6          3.4           1.4          0.3
setosa            5.0          3.4           1.5          0.2
setosa            4.4          2.9           1.4          0.2
setosa            4.9          3.1           1.5          0.1

In [46]:
df.iloc[5]

sepal_length       5.4
sepal_width        3.9
petal_length       1.7
petal_width        0.4
species         setosa
Name: 5, dtype: object

In [57]:
df.set_index('States',inplace=True)
df

               W         X         Y         Z       new
States
CA     -0.311262 -0.105548 -0.245949  0.613357 -0.557211
NY     -0.168928 -1.279977 -0.587057  1.734285 -0.755985
WY     -2.028401 -2.449713 -0.827067 -1.867082 -2.855468
OR     -0.643578  0.116364 -0.173733 -0.961986 -0.817310
CO      0.144145  0.304137  1.668903 -1.212063  1.813047

In [50]:
df.rename(columns={'species':'Species'}, inplace=True)
df.head()

/var/folders/0b/_lhktjtd7_nbl39rvt0kjvmr0000gn/T/ipykernel_46729/4001293747.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df.rename(columns={'species':'Species'}, inplace=True)

   sepal_length  sepal_width  petal_length  petal_width Species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

## Multi-Index and Index Hierarchy

Let us go over how to work with Multi-Index, first we'll create a quick example of what a Multi-Indexed DataFrame would look like:

In [59]:
# Index Levels
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [60]:
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [61]:
from numpy.random import randn
df = pd.DataFrame(randn(6,2),index=hier_index,columns=['A','B'])
#df.loc['G2'].to_csv('G2.csv', index = False)
df

             A         B
G1 1 -0.198018  1.269513
   2 -0.248981  0.719686
   3 -0.771240 -1.923306
G2 1  0.010229  0.277731
   2  0.263435  0.375435
   3  0.639013  0.165957

Now let's show how to index this! For index hierarchy we use df.loc[], if this was on the columns axis, you would just use normal bracket notation df[]. Calling one level of the index returns the sub-dataframe:

In [62]:
df.loc['G1']

          A         B
1 -0.198018  1.269513
2 -0.248981  0.719686
3 -0.771240 -1.923306

In [63]:
df.loc['G1'].loc[1]

A   -0.198018
B    1.269513
Name: 1, dtype: float64

In [64]:
df.loc['G1'].iloc[0]

A   -0.198018
B    1.269513
Name: 1, dtype: float64

In [65]:
df.loc['G1'].iloc[1]

A   -0.248981
B    0.719686
Name: 2, dtype: float64

In [42]:
df.index.names

FrozenList([None, None])

In [66]:
df.index.names = ['Group','Num']

In [67]:
df

                  A         B
Group Num
G1    1   -0.198018  1.269513
      2   -0.248981  0.719686
      3   -0.771240 -1.923306
G2    1    0.010229  0.277731
      2    0.263435  0.375435
      3    0.639013  0.165957

In [68]:
df.xs('G1') # df.loc['G1']

            A         B
Num
1   -0.198018  1.269513
2   -0.248981  0.719686
3   -0.771240 -1.923306

In [65]:
df.xs(['G1',1]) # df.loc['G1'].loc[1]

/var/folders/0b/_lhktjtd7_nbl39rvt0kjvmr0000gn/T/ipykernel_33691/2259908157.py:1: FutureWarning: Passing lists as key for xs is deprecated and will be removed in a future version. Pass key as a tuple instead.
  df.xs(['G1',1]) # df.loc['G1'].loc[1]

A   -1.440036
B    1.531947
Name: (G1, 1), dtype: float64

In [69]:
df

                  A         B
Group Num
G1    1   -0.198018  1.269513
      2   -0.248981  0.719686
      3   -0.771240 -1.923306
G2    1    0.010229  0.277731
      2    0.263435  0.375435
      3    0.639013  0.165957

In [71]:
df.xs(1,level='Num')['A']

Group
G1   -0.198018
G2    0.010229
Name: A, dtype: float64

In [ ]:
# make a array of 100 elements consisting of 8, 3, 5 with percentage 30, 20, 50
np